zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp257axx_cm0.h
/*
* @brief RTC Specific device feature definitions
*/
#define RTC_BKP_NB         128U
#define RTC_TAMP_NB        8U
#define RTC_INT_TAMP_NB    14U

/**
  * @brief Real-Time Clock
  */
typedef struct
{
  __IO uint32_t TR;             /*!< RTC time register                                Address offset: 0x000 */
  __IO uint32_t DR;             /*!< RTC date register                                Address offset: 0x004 */
  __IO uint32_t SSR;            /*!< RTC sub second register                          Address offset: 0x008 */
  __IO uint32_t ICSR;           /*!< RTC initialization control and status register   Address offset: 0x00C */
  __IO uint32_t PRER;           /*!< RTC prescaler register                           Address offset: 0x010 */
  __IO uint32_t WUTR;           /*!< RTC wakeup timer register                        Address offset: 0x014 */
  __IO uint32_t CR;             /*!< RTC control register                             Address offset: 0x018 */
  __IO uint32_t PRIVCR;         /*!< RTC privilege mode control register              Address offset: 0x01C */
  __IO uint32_t SECCFGR;        /*!< RTC secure mode control register                 Address offset: 0x020 */
  __IO uint32_t WPR;            /*!< RTC write protection register                    Address offset: 0x024 */
  __IO uint32_t CALR;           /*!< RTC calibration register                         Address offset: 0x028 */
  __IO uint32_t SHIFTR;         /*!< RTC shift control register                       Address offset: 0x02C */
  __IO uint32_t TSTR;           /*!< RTC timestamp time register                      Address offset: 0x030 */
  __IO uint32_t TSDR;           /*!< RTC timestamp date register                      Address offset: 0x034 */
  __IO uint32_t TSSSR;          /*!< RTC timestamp sub second register                Address offset: 0x038 */
       uint32_t RESERVED0;      /*!< Reserved                                         Address offset: 0x03C */
  __IO uint32_t ALRMAR;         /*!< RTC alarm A register                             Address offset: 0x040 */
  __IO uint32_t ALRMASSR;       /*!< RTC alarm A sub second register                  Address offset: 0x044 */
  __IO uint32_t ALRMBR;         /*!< RTC alarm B register                             Address offset: 0x048 */
  __IO uint32_t ALRMBSSR;       /*!< RTC alarm B sub second register                  Address offset: 0x04C */
  __IO uint32_t SR;             /*!< RTC Status register                              Address offset: 0x050 */
  __IO uint32_t MISR;           /*!< RTC non-secure masked interrupt status register  Address offset: 0x054 */
  __IO uint32_t SMISR;          /*!< RTC secure masked interrupt status register      Address offset: 0x058 */
  __IO uint32_t SCR;            /*!< RTC status Clear register                        Address offset: 0x05C */
  __IO uint32_t CFGR;           /*!< RTC configuration register                       Address offset: 0x060 */
       uint32_t RESERVED1[3];   /*!< Reserved                                         Address offset: 0x064-0x06C */
  __IO uint32_t ALRABINR;       /*!< RTC alarm A binary mode register                 Address offset: 0x070 */
  __IO uint32_t ALRBBINR;       /*!< RTC alarm B binary mode register                 Address offset: 0x074 */
       uint32_t RESERVED2[2];   /*!< Reserved                                         Address offset: 0x078-0x07C */
  __IO uint32_t RCIDCFGR[6];    /*!< RTC Resource x CID configuration register        Address offset: 0x080-0x094 */
       uint32_t RESERVED3[214]; /*!< Reserved                                         Address offset: 0x098-0x3EC */
  __IO uint32_t HWCFGR;         /*!< RTC hardware configuration register              Address offset: 0x3F0 */
  __IO uint32_t VERR;           /*!< RTC version register                             Address offset: 0x3F4 */
  __IO uint32_t IPIDR;          /*!< RTC identification register                      Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< RTC size identification register                 Address offset: 0x3FC */
} RTC_TypeDef;


/**
  * @brief SPI/I2S
  *
  *     Serial peripheral interface and integrated interchip sound
  *     User Spec c7amba_spi2s3 version v2.0  (April 21th, 2020 Draft!!)
  *
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< SPI/I2S Control register 1,                         Address offset: 0x000       */
  __IO uint32_t CR2;              /*!< SPI Control register 2,                             Address offset: 0x004       */
  __IO uint32_t CFG1;             /*!< SPI Configuration register 1,                       Address offset: 0x008       */
  __IO uint32_t CFG2;             /*!< SPI Configuration register 2,                       Address offset: 0x00C       */
  __IO uint32_t IER;              /*!< SPI/I2S Interrupt Enable register,                  Address offset: 0x010       */
  __IO uint32_t SR;               /*!< SPI Status register,                                Address offset: 0x014       */
  __IO uint32_t IFCR;             /*!< SPI/I2S Interrupt/Status Flags Clear register,      Address offset: 0x018       */
  __IO uint32_t AUTOCR;           /*!< SPI/I2S Autonomous Mode Control register,           Address offset: 0x01C       */
  __IO uint32_t TXDR;             /*!< SPI/I2S Transmit data register,                     Address offset: 0x020       */
  uint32_t      RESERVED0[3];     /*!< Reserved,                                           Address offset: 0x024-0x02C */
  __IO uint32_t RXDR;             /*!< SPI/I2S Receive data register,                      Address offset: 0x030       */
  uint32_t      RESERVED1[3];     /*!< Reserved,                                           Adresse offset: 0X034-0x03C */
  __IO uint32_t CRCPOLY;          /*!< SPI CRC Polynomial register,                        Address offset: 0x040       */
  __IO uint32_t TXCRC;            /*!< SPI Transmitter CRC register,                       Address offset: 0x044       */
  __IO uint32_t RXCRC;            /*!< SPI Receiver CRC register,                          Address offset: 0x048       */
  __IO uint32_t UDRDR;            /*!< SPI Underrun data register,                         Address offset: 0x04C       */
  __IO uint32_t I2SCFGR;          /*!< SPI/I2S configuration register,                     Address offset: 0x050       */
  uint32_t      RESERVED2[230];   /*!< Reserved,                                           Adresse offset: 0X054-0x3E8 */
  __IO uint32_t HWCFGR2;          /*!< SPI/I2S hardware configuration register 2,          Address offset: 0x03EC      */
  __IO uint32_t HWCFGR1;          /*!< SPI/I2S hardware configuration register 1,          Address offset: 0x03F0      */
  __IO uint32_t VERR;             /*!< SPI/I2S Version register,                           Address offset: 0x03F4      */
  __IO uint32_t IPIDR;            /*!< SPI/I2S Identification register,                    Address offset: 0x03F8      */
  __IO uint32_t SIDR;             /*!< SPI/I2S Size Identification register,               Address offset: 0x03FC      */
} SPI_TypeDef;

